import re
def divide_address(address):
  matches = re.match(r'(...??[都道府県])((?:旭川|伊達|石狩|盛岡|奥州|田村|南相馬|那須塩原|東村山|武蔵村山|羽村|十日町|上越|富山|野々市|大町|蒲郡|四日市|姫路|大和郡山|廿日市|下松|岩国|田川|大村)市|.+?郡(?:玉村|大町|.+?)[町村]|.+?市.+?区|.+?[市区町村])(.+)' , address)
  rematches1 = re.match(r'(..[市])(.+)',matches[2])
  rematches2 = re.match(r'(赤井町|旭町|市場町|稲荷町|亥鼻|A今井Z|今井町|院内|鵜の森町|大森町|生実町|春日|葛城|要町|亀井町|亀岡町|川崎町|川戸町|栄町|寒川町|塩田町|汐見丘町|白旗|新宿|新千葉|新田町|新町|神明町|末広|A蘇我Z|蘇我町|大巌寺町|千葉寺町|千葉港|A中央Z|中央港|椿森|鶴沢町|出洲港|A道場北Z|道場北町|道場南|問屋町|長洲|新浜町|仁戸名町|登戸|花輪町|浜野町|東千葉|東本町|富士見|弁天|星久喜町|本千葉町|本町|松ヶ丘町|松波|港町|南生実町|南町|都町|宮崎|宮崎町|村田町|矢作町|祐光|若草|A穴川Z|穴川町|あやめ台|稲丘町|A稲毛Z|稲毛台町|稲毛町|稲毛東|柏台|黒砂|黒砂台|A小仲台Z|小中台町|小深町|A作草部Z|作草部町|山王町|園生町|千草台|A天台Z|天台町|轟町|A長沼町Z|長沼原町|萩台町|緑町|宮野木町|弥生町|六方町|愛生町|五十土町|和泉町|大井戸町|大草町|太田町|大広町|大宮町|大宮台|小倉町|小倉台|小間子町|御成台|A貝塚Z|貝塚町|加曽利町|金親町|上泉町|川井町|北大宮台|北谷津町|古泉町|御殿町|坂月町|A桜木Z|桜木北|更科町|佐和町|下泉町|下田町|高品町|高根町|多部田町|旦谷町|千城台北|千城台西|千城台東|千城台南|都賀|都賀の台|殿台町|富田町|中田町|中野町|西都賀|野呂町|原町|東寺山町|みつわ台|源町|谷当町|若松町|若松台|花見川区|朝日ケ丘|朝日ケ丘町|天戸町|内山町|宇那谷町|A柏井Z|柏井町|検見川町|こてはし台|犢橋町|作新台|さつきが丘|三角町|大日町|武石町|千種町|長作台|長作町|浪花町|西小中台|畑町|花島町花園|花園町|花見川|幕張町|幕張本郷|瑞穂|南花園|み春野|宮野木台|横戸台|横戸町|緑区|あすみが丘|あすみが丘東|板倉町|大金沢町|大木戸町|大椎町|大高町|落井町|越智町|小山町|大野台|Aおゆみ野Z|おゆみ野有吉|おゆみ野中央|おゆみ野南|刈田子町|鎌取町|上大和田町|小金沢町|椎名崎町|下大和田町|大膳野町|高田町|高津戸町|土気町|富岡町|中西町|東山科町|平川町|平山町|古市場町|辺田町|誉田町|茂呂町|小食土町|美浜区|磯辺|稲毛|海岸|打瀬|幸町|新港|高洲|高浜|豊砂|中瀬|浜田|ひび野|幕張西|真砂|美浜|若葉)(.+)',matches[3])

  print(matches[1])
  print(rematches1[1])
  print(rematches1[2])
  print(rematches2[1])
  print(rematches2[2])
if __name__ == '__main__':
  address = "千葉県千葉市稲毛区穴川町81"
  divide_address(address)

#   print(matches[1])
#   print(matches[2])
#   print(matches[3])
# if __name__ == '__main__':
#   address = "千葉県千葉市稲毛区穴川町81"
#   divide_address(address)